Import perpustakaan

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy as db
import matplotlib.pyplot as plt
import seaborn as sns

Panggil database data_hujan.sqlite

In [23]:
database = db.create_engine("sqlite:///data_hujan_fix.sqlite")
conn = database.connect()

In [24]:
# Tanpa CTE
data_gabungan_1 = """
    SELECT
        a1.Wilayah,
        a1.CH,
        a2.Temp
    FROM data_hujan a1
    LEFT JOIN data_temperatur a2 ON a1.CH = a2.CH
"""

data_bersih_no_CTE = pd.read_sql_query(data_gabungan_1, conn)
data_bersih_no_CTE

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

In [26]:
# Menggunakan CTE
data_gabungan_2 = """
    WITH data_x AS (
        SELECT
            a1.Wilayah,
            a1.CH,
            a2.Temp
        FROM data_hujan a1
        LEFT JOIN data_temperatur a2 ON a1.CH = a2.CH
    )

    SELECT * FROM data_x
"""

data_CTE = pd.read_sql_query(data_gabungan_2, conn)
data_CTE

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

Kita mencoba panggil data darai SQLdatabasenya dan gabungan data menjadi 1

In [29]:
data_CTE.to_csv("data_gabungan_final.csv", index=None) # Gabungkan data

In [30]:
data_mentah = pd.read_csv("data_gabungan_final.csv")
data_mentah

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

In [31]:
data_wilayah = data_mentah['Wilayah'].drop_duplicates()
data_wilayah

0        Sumatera
10    DKI Jakarta
22     Kalimantan
33    Jawa Tengah
44     Jawa Timur
Name: Wilayah, dtype: object

In [32]:
data_curah_hujan = data_CTE.groupby('Wilayah')
data_curah_hujan_avg = data_curah_hujan.agg(
    rata_rata = ("CH","mean")
)
data_curah_hujan_avg_fix = data_curah_hujan_avg.reset_index()
data_curah_hujan_avg_fix

       Wilayah  rata_rata
0  DKI Jakarta  42.000000
1  Jawa Tengah  67.016393
2   Jawa Timur  55.590164
3   Kalimantan  34.868852
4     Sumatera  39.588235

In [34]:
data_curah_hujan_max = data_CTE.groupby("Wilayah")
data_curah_hujan_sum = data_curah_hujan_max.agg(
    jumlah = ("CH", "sum")
)

data_curah_hujan_sum = data_curah_hujan_sum.reset_index()
data_curah_hujan_sum.loc[data_curah_hujan_sum["Wilayah"].idxmax()]

Wilayah    Sumatera
jumlah         4038
Name: 4, dtype: object

In [4]:
data_hujan

        Wilayah  CH ( mm )
0      Sumatera         34
1   DKI Jakarta         42
2    Kalimantan         32
3   Jawa Tengah         67
4    Jawa Timur         56
5      Sumatera         34
6   DKI Jakarta         42
7    Kalimantan         32
8   Jawa Tengah         67
9    Jawa Timur         56
10     Sumatera         34
11  DKI Jakarta         42
12   Kalimantan         32
13  Jawa Tengah         69
14   Jawa Timur         56
15     Sumatera         34
16  DKI Jakarta         42
17   Kalimantan        382
18  Jawa Tengah         67
19   Jawa Timur         56
20     Sumatera        304
21  DKI Jakarta         42
22   Kalimantan         32
23  Jawa Tengah         67
24   Jawa Timur         56
25     Sumatera         34
26  DKI Jakarta         42
27   Kalimantan         32
28  Jawa Tengah         67
29   Jawa Timur         56
30     Sumatera         34
31  DKI Jakarta         42
32   Kalimantan         32
33  Jawa Tengah         67
34   Jawa Timur         56
35     Sumatera         34
36  DKI Jakarta         42
37   Kalimantan         32
38  Jawa Tengah         67
39   Jawa Timur         56
40     Sumatera         34
41  DKI Jakarta         42
42   Kalimantan         32
43  Jawa Tengah         67
44   Jawa Timur         56
45     Sumatera         34
46  DKI Jakarta         42
47   Kalimantan         32
48  Jawa Tengah         67
49   Jawa Timur         56
50     Sumatera         34
51  DKI Jakarta         42
52   Kalimantan         32
53  Jawa Tengah         67
54   Jawa Timur         56
55     Sumatera        334
56  DKI Jakarta         42
57   Kalimantan         32
58  Jawa Tengah         67
59   Jawa Timur          6